BASE_LINK = "https://cian.ru/cat.php?engine_version=2&p={}&region={}"
ACCOMMODATION_TYPE_PARAMETER = "&offer_type={}"
DURATION_TYPE_PARAMETER = "&type={}"
DEAL_TYPE = "&deal_type={}"

FLOATS_NUMBERS_REG_EXPRESSION = r"[+-]? *(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][+-]?\d+)?"

ROOM = "&room{}=1"
STUDIO = "&room9=1"
WITHOUT_NEIGHBORS_OF_CITY = "&with_neighbors=0"
IS_ONLY_HOMEOWNER = "&is_by_homeowner=1"

CITIES = [['Абакан', '4628'], ['Анадырь', '4634'], ['Анапа', '5129'], ['Архангельск', '4557'], ['Астрахань', '4558'], ['Барнаул', '4555'], ['Белгород', '4561'], ['Биробиджан', '4569'], ['Благовещенск', '4556'], ['Бронницы', '4690'], ['Брянск', '4562'], ['Видный', '5922'], ['Владивосток', '4604'], ['Владикавказ', '4613'], ['Владимир', '4564'], ['Волгоград', '4565'], ['Вологда', '4566'], ['Волоколамск', '5379'], ['Воронеж', '4567'], ['Воскресенск', '5388'], ['Геленджик', '4717'], ['Горно-Алтайск', '4554'], ['Грозный', '4631'], ['Дзержинский', '4734'], ['Дмитров', '5482'], ['Долгопрудный', '4738'], ['Дубна', '4741'], ['Екатеринбург', '4612'], ['Жуковский', '4750'], ['Звенигород', '4756'], ['Иванов', '4570'], ['Ижевск', '4624'], ['Иркутск', '4572'], ['Йошкар-Ола', '4591'], ['Казань', '4618'], ['Калининград', '4574'], ['Калуга', '4576'], ['Кемерово', '4580'], ['Киров', '4581'], ['Коломна', '4809'], ['Королёв', '4813'], ['Кострома', '4583'], ['Красноармейск', '4817'], ['Краснодар', '4584'], ['Краснознаменск', '4822'], ['Красноярск', '4585'], ['Курган', '4586'], ['Курск', '4587'], ['Кызыл', '4622'], ['Липецк', '4589'], ['Лобня', '4848'], ['Лыткарино', '4851'], ['Магадан', '4590'], ['Майкоп', '4553'], ['Махачкала', '4568'], ['Москва', '1'], ['Мурманск', '4594'], ['Назрань', '4571'], ['Нальчик', '4573'], ['Нарьян-Мар', '4595'], ['Новгород', '4596'], ['Новороссийск', '4896'], ['Новосибирск', '4598'], ['Омск', '4599'], ['Оренбург', '4600'], ['Орехово-Зуево', '4916'], ['Орёл', '4601'], ['Пенза', '4602'], ['Пермь', '4603'], ['Петрозаводск', '4579'], ['Петропавловск-Камчатский', '4577'], ['Подольск', '4935'], ['Протвино', '4945'], ['Псков', '4605'], ['Пущино', '4949'], ['Реутов', '4958'], ['Ростов-На-Дону', '4606'], ['Рошаль', '4960'], ['Рязань', '4607'], ['Салехард', '4635'], ['Самара', '4608'], ['Санкт-Петербург', '2'], ['Саранск', '4592'], ['Саратов', '4609'], ['Серпухов', '4983'], ['Смоленск', '4614'], ['Сочи', '4998'], ['Ставрополь', '4615'], ['Сургут', '5003'], ['Сыктывкар', '4582'], ['Тамбов', '4617'], ['Тверь', '4619'], ['Тольятти', '5015'], ['Томск', '4620'], ['Тула', '4621'], ['Тюмень', '4623'], ['Улан-Удэ', '4563'], ['Ульяновск', '4625'], ['Уфа', '4560'], ['Фрязино', '5038'], ['Хабаровск', '4627'], ['Ханты-Мансийск', '4629'], ['Химки', '5044'], ['Чебоксары', '4633'], ['Челябинск', '4630'], ['Череповец', '5050'], ['Черкесск', '4578'], ['Чита', '4720'], ['Электросталь', '5064'], ['Элиста', '4575'], ['Южно-Сахалинск', '4611'], ['Якутск', '4610'], ['Ярославль', '4636']]

NOT_STREET_ADDRESS_ELEMENTS = {"ЖК", "м.", "мкр.", "Жилой комплекс", "Жилой Комплекс"}

SPECIFIC_FIELDS_FOR_RENT_LONG = {"price_per_month", "commissions"}
SPECIFIC_FIELDS_FOR_RENT_SHORT = {"price_per_day"}
SPECIFIC_FIELDS_FOR_SALE = {"price", "residential_complex"}
